const taskHW = [
  {
    title: "1) useEffect:",
    description: "Створіть компонент, який використовує хук useEffect. При кожному оновленні компонента хук useEffect має викликатися і виводити повідомлення в консоль. Перевірте, що повідомлення виводяться під час рендерингу компонента та після його оновлення. (Оновлювати компонент маєте будь як).",
  },
  {
    title: '2) useState:',
    description: 'Створіть компонент, який використовує хук useState. При натисканні на кнопку нехай виводиться рандомно фразу “Hello …”, де “…” буде рандомне імʼя, додайте мінімум 5 імен.',
  },
  {
    title: '3) useReducer:',
    description: 'Створіть компонент, який використовує хук useReducer. Додайте 3 кнопки “Імʼя”, “Пвізвище”, “Рік народження”. Додайте аналогічні 3 текстові поля “input”. initialState = {name: ‘’, lastName: ‘’, birthYear: ‘’}. Після вводу в текстове поле з іменем і натискання на кнопку “Імʼя”, має додати введений текст в обʼєкт поле “name”, і т.д. Виведіть обʼєкт на екран.',
  },
  {
    title: '4) useRef:',
    description: 'Створіть компонент, який використовує хук useRef. Створіть текстове поле та кнопку “Фокус" та “Блюр”. При натисканні на кнопку “Фокус”, фокус повинен переміститися в текстове поле за допомогою хука useRef. При натисканні на кнопку “Блюр”, фокус має відмінитись із текстового поля.',
  },
  {
    title: '5) useLayoutEffect:',
    description: 'Створіть компонент, який використовує хук useLayoutEffect. У цьому хуці ви можете змінювати DOM безпосередньо. Створіть кнопку, яка при натисканні додає абзац до сторінки, використовуючи useLayoutEffect. Перевірте, що зміни відображаються миттєво після натискання кнопки.',
  },
]

export default taskHW